sink/openupdate/src/test/resources/mappings/mapping-CatalogingUpdateServices-UpdateService-ValidationError.json

{
  "request" : {
    "url" : "/CatalogingUpdateServices/UpdateService",
    "method" : "POST",
    "bodyPatterns" : [ {
      "equalToXml" : "<?xml version=\"1.0\" ?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><updateRecord xmlns=\"http://oss.dbc.dk/ns/catalogingUpdate\"><updateRecordRequest><authentication><groupIdAut>010100</groupIdAut><passwordAut>20Koster</passwordAut><userIdAut>netpunkt</userIdAut></authentication><schemaName>dbc</schemaName><bibliographicRecord><recordSchema>info:lc/xmlns/marcxchange-v1</recordSchema><recordPacking>xml</recordPacking><recordData><marcx:record xmlns:marcx=\"info:lc/xmlns/marcxchange-v1\"><marcx:leader>00000c    2200000   4500</marcx:leader><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"001\"><marcx:subfield code=\"a\">D969866622</marcx:subfield><marcx:subfield code=\"f\">a</marcx:subfield><marcx:subfield code=\"o\">d</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"004\"><marcx:subfield code=\"r\">c</marcx:subfield><marcx:subfield code=\"a\">e</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"008\"><marcx:subfield code=\"t\">m</marcx:subfield><marcx:subfield code=\"u\">r</marcx:subfield><marcx:subfield code=\"a\">1948</marcx:subfield><marcx:subfield code=\"z\">1957</marcx:subfield><marcx:subfield code=\"b\">gb</marcx:subfield><marcx:subfield code=\"v\">1</marcx:subfield><marcx:subfield code=\"l\">eng</marcx:subfield><marcx:subfield code=\"&amp;\">2</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"009\"><marcx:subfield code=\"a\">a</marcx:subfield><marcx:subfield code=\"g\">xx</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"041\"><marcx:subfield code=\"a\">eng</marcx:subfield><marcx:subfield code=\"c\">fre</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"088\"><marcx:subfield code=\"a\">840SART1</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"096\"><marcx:subfield code=\"a\">1</marcx:subfield><marcx:subfield code=\"b\">se: 9780413776396</marcx:subfield><marcx:subfield code=\"c\">b</marcx:subfield><marcx:subfield code=\"z\">820040</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"100\"><marcx:subfield code=\"a\">Sartre</marcx:subfield><marcx:subfield code=\"h\">Jean-Paul</marcx:subfield><marcx:subfield code=\"c\">1905-1980</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"241\"><marcx:subfield code=\"a\">Existentialisme est un humanisme</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"245\"><marcx:subfield code=\"a\">Existentialism and humanism</marcx:subfield><marcx:subfield code=\"e\">Jean-Paul Sartre</marcx:subfield><marcx:subfield code=\"e\">translation and introduction by Philip Mairet</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"260\"><marcx:subfield code=\"a\">London</marcx:subfield><marcx:subfield code=\"b\">Methuen</marcx:subfield><marcx:subfield code=\"c\">1957</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"300\"><marcx:subfield code=\"a\">70 s.</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\"><marcx:subfield code=\"a\">20070501</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\"><marcx:subfield code=\"a\">kat061221</marcx:subfield><marcx:subfield code=\"a\">gave</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\"><marcx:subfield code=\"a\">sle090713 bortk.</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\"><marcx:subfield code=\"a\">genoplivet151013</marcx:subfield></marcx:datafield></marcx:record></recordData><extraRecordData></extraRecordData></bibliographicRecord></updateRecordRequest></updateRecord></S:Body></S:Envelope>"
    } ]
  },
  "response" : {
    "status" : 200,
    "bodyFileName" : "body-CatalogingUpdateServices-UpdateService-ValidationError.json",
    "headers" : {
      "Server" : "grizzly/2.3.1",
      "Content-Type" : "text/xml;charset=utf-8",
      "Date" : "Fri, 16 Oct 2015 12:20:20 GMT",
      "Transfer-Encoding" : "chunked"
    }
  }
}